Microchip-MPLAB-Harmony/touch_apps/apps/qt8_selfcap_surface_xpro_board/pic32cm_pl10_cnano_water_tolerance/firmware/src/packs/PIC32CM6408PL10048_DFP/component/rtc.h
#define RTC_MODE1_SYNCBUSY_COMP_Pos           _UINT32_(5)                                          /* (RTC_MODE1_SYNCBUSY Position) Compare x Value Synchronization Busy */
#define RTC_MODE1_SYNCBUSY_COMP_Msk           (_UINT32_(0x3) << RTC_MODE1_SYNCBUSY_COMP_Pos)       /* (RTC_MODE1_SYNCBUSY Mask) COMP */
#define RTC_MODE1_SYNCBUSY_COMP(value)        (RTC_MODE1_SYNCBUSY_COMP_Msk & (_UINT32_(value) << RTC_MODE1_SYNCBUSY_COMP_Pos)) 

/* -------- RTC_MODE2_SYNCBUSY : (RTC Offset: 0x10) ( R/ 32) MODE2 Synchronization Busy -------- */
#define RTC_MODE2_SYNCBUSY_RESETVALUE         _UINT32_(0x00)                                       /*  (RTC_MODE2_SYNCBUSY) MODE2 Synchronization Busy  Reset Value */

#define RTC_MODE2_SYNCBUSY_SWRST_Pos          _UINT32_(0)                                          /* (RTC_MODE2_SYNCBUSY) Software Reset Synchronization Busy Position */
#define RTC_MODE2_SYNCBUSY_SWRST_Msk          (_UINT32_(0x1) << RTC_MODE2_SYNCBUSY_SWRST_Pos)      /* (RTC_MODE2_SYNCBUSY) Software Reset Synchronization Busy Mask */
#define RTC_MODE2_SYNCBUSY_SWRST(value)       (RTC_MODE2_SYNCBUSY_SWRST_Msk & (_UINT32_(value) << RTC_MODE2_SYNCBUSY_SWRST_Pos)) /* Assignment of value for SWRST in the RTC_MODE2_SYNCBUSY register */
#define RTC_MODE2_SYNCBUSY_ENABLE_Pos         _UINT32_(1)                                          /* (RTC_MODE2_SYNCBUSY) Enable Synchronization Busy Position */
#define RTC_MODE2_SYNCBUSY_ENABLE_Msk         (_UINT32_(0x1) << RTC_MODE2_SYNCBUSY_ENABLE_Pos)     /* (RTC_MODE2_SYNCBUSY) Enable Synchronization Busy Mask */
#define RTC_MODE2_SYNCBUSY_ENABLE(value)      (RTC_MODE2_SYNCBUSY_ENABLE_Msk & (_UINT32_(value) << RTC_MODE2_SYNCBUSY_ENABLE_Pos)) /* Assignment of value for ENABLE in the RTC_MODE2_SYNCBUSY register */
#define RTC_MODE2_SYNCBUSY_FREQCORR_Pos       _UINT32_(2)                                          /* (RTC_MODE2_SYNCBUSY) Frequency Correction Synchronization Busy Position */
#define RTC_MODE2_SYNCBUSY_FREQCORR_Msk       (_UINT32_(0x1) << RTC_MODE2_SYNCBUSY_FREQCORR_Pos)   /* (RTC_MODE2_SYNCBUSY) Frequency Correction Synchronization Busy Mask */
#define RTC_MODE2_SYNCBUSY_FREQCORR(value)    (RTC_MODE2_SYNCBUSY_FREQCORR_Msk & (_UINT32_(value) << RTC_MODE2_SYNCBUSY_FREQCORR_Pos)) /* Assignment of value for FREQCORR in the RTC_MODE2_SYNCBUSY register */
#define RTC_MODE2_SYNCBUSY_CLOCK_Pos          _UINT32_(3)                                          /* (RTC_MODE2_SYNCBUSY) Clock Value Synchronization Busy Position */
#define RTC_MODE2_SYNCBUSY_CLOCK_Msk          (_UINT32_(0x1) << RTC_MODE2_SYNCBUSY_CLOCK_Pos)      /* (RTC_MODE2_SYNCBUSY) Clock Value Synchronization Busy Mask */
#define RTC_MODE2_SYNCBUSY_CLOCK(value)       (RTC_MODE2_SYNCBUSY_CLOCK_Msk & (_UINT32_(value) << RTC_MODE2_SYNCBUSY_CLOCK_Pos)) /* Assignment of value for CLOCK in the RTC_MODE2_SYNCBUSY register */
#define RTC_MODE2_SYNCBUSY_ALARM0_Pos         _UINT32_(5)                                          /* (RTC_MODE2_SYNCBUSY) Alarm 0 Value Synchronization Busy Position */
#define RTC_MODE2_SYNCBUSY_ALARM0_Msk         (_UINT32_(0x1) << RTC_MODE2_SYNCBUSY_ALARM0_Pos)     /* (RTC_MODE2_SYNCBUSY) Alarm 0 Value Synchronization Busy Mask */
#define RTC_MODE2_SYNCBUSY_ALARM0(value)      (RTC_MODE2_SYNCBUSY_ALARM0_Msk & (_UINT32_(value) << RTC_MODE2_SYNCBUSY_ALARM0_Pos)) /* Assignment of value for ALARM0 in the RTC_MODE2_SYNCBUSY register */
#define RTC_MODE2_SYNCBUSY_MASK0_Pos          _UINT32_(11)                                         /* (RTC_MODE2_SYNCBUSY) Alarm 0 Mask Synchronization Busy Position */
#define RTC_MODE2_SYNCBUSY_MASK0_Msk          (_UINT32_(0x1) << RTC_MODE2_SYNCBUSY_MASK0_Pos)      /* (RTC_MODE2_SYNCBUSY) Alarm 0 Mask Synchronization Busy Mask */
#define RTC_MODE2_SYNCBUSY_MASK0(value)       (RTC_MODE2_SYNCBUSY_MASK0_Msk & (_UINT32_(value) << RTC_MODE2_SYNCBUSY_MASK0_Pos)) /* Assignment of value for MASK0 in the RTC_MODE2_SYNCBUSY register */
#define RTC_MODE2_SYNCBUSY_CLOCKSYNC_Pos      _UINT32_(15)                                         /* (RTC_MODE2_SYNCBUSY) CLOCK Read Resynchronization Enable Synchronization Busy Position */
#define RTC_MODE2_SYNCBUSY_CLOCKSYNC_Msk      (_UINT32_(0x1) << RTC_MODE2_SYNCBUSY_CLOCKSYNC_Pos)  /* (RTC_MODE2_SYNCBUSY) CLOCK Read Resynchronization Enable Synchronization Busy Mask */
#define RTC_MODE2_SYNCBUSY_CLOCKSYNC(value)   (RTC_MODE2_SYNCBUSY_CLOCKSYNC_Msk & (_UINT32_(value) << RTC_MODE2_SYNCBUSY_CLOCKSYNC_Pos)) /* Assignment of value for CLOCKSYNC in the RTC_MODE2_SYNCBUSY register */
#define RTC_MODE2_SYNCBUSY_Msk                _UINT32_(0x0000882F)                                 /* (RTC_MODE2_SYNCBUSY) Register Mask  */

#define RTC_MODE2_SYNCBUSY_ALARM_Pos          _UINT32_(5)                                          /* (RTC_MODE2_SYNCBUSY Position) Alarm x Value Synchronization Busy */
#define RTC_MODE2_SYNCBUSY_ALARM_Msk          (_UINT32_(0x1) << RTC_MODE2_SYNCBUSY_ALARM_Pos)      /* (RTC_MODE2_SYNCBUSY Mask) ALARM */
#define RTC_MODE2_SYNCBUSY_ALARM(value)       (RTC_MODE2_SYNCBUSY_ALARM_Msk & (_UINT32_(value) << RTC_MODE2_SYNCBUSY_ALARM_Pos)) 
#define RTC_MODE2_SYNCBUSY_MASK_Pos           _UINT32_(11)                                         /* (RTC_MODE2_SYNCBUSY Position) Alarm x Mask Synchronization Busy */
#define RTC_MODE2_SYNCBUSY_MASK_Msk           (_UINT32_(0x1) << RTC_MODE2_SYNCBUSY_MASK_Pos)       /* (RTC_MODE2_SYNCBUSY Mask) MASK */
#define RTC_MODE2_SYNCBUSY_MASK(value)        (RTC_MODE2_SYNCBUSY_MASK_Msk & (_UINT32_(value) << RTC_MODE2_SYNCBUSY_MASK_Pos)) 

/* -------- RTC_FREQCORR : (RTC Offset: 0x14) (R/W 8) Frequency Correction -------- */
#define RTC_FREQCORR_RESETVALUE               _UINT8_(0x00)                                        /*  (RTC_FREQCORR) Frequency Correction  Reset Value */

#define RTC_FREQCORR_VALUE_Pos                _UINT8_(0)                                           /* (RTC_FREQCORR) Correction Value Position */
#define RTC_FREQCORR_VALUE_Msk                (_UINT8_(0x7F) << RTC_FREQCORR_VALUE_Pos)            /* (RTC_FREQCORR) Correction Value Mask */
#define RTC_FREQCORR_VALUE(value)             (RTC_FREQCORR_VALUE_Msk & (_UINT8_(value) << RTC_FREQCORR_VALUE_Pos)) /* Assignment of value for VALUE in the RTC_FREQCORR register */
#define RTC_FREQCORR_SIGN_Pos                 _UINT8_(7)                                           /* (RTC_FREQCORR) Correction Sign Position */
#define RTC_FREQCORR_SIGN_Msk                 (_UINT8_(0x1) << RTC_FREQCORR_SIGN_Pos)              /* (RTC_FREQCORR) Correction Sign Mask */
#define RTC_FREQCORR_SIGN(value)              (RTC_FREQCORR_SIGN_Msk & (_UINT8_(value) << RTC_FREQCORR_SIGN_Pos)) /* Assignment of value for SIGN in the RTC_FREQCORR register */
#define RTC_FREQCORR_Msk                      _UINT8_(0xFF)                                        /* (RTC_FREQCORR) Register Mask  */


/* -------- RTC_MODE0_COUNT : (RTC Offset: 0x18) (R/W 32) MODE0 Counter Value -------- */
#define RTC_MODE0_COUNT_RESETVALUE            _UINT32_(0x00)                                       /*  (RTC_MODE0_COUNT) MODE0 Counter Value  Reset Value */

#define RTC_MODE0_COUNT_COUNT_Pos             _UINT32_(0)                                          /* (RTC_MODE0_COUNT) Counter Value Position */
#define RTC_MODE0_COUNT_COUNT_Msk             (_UINT32_(0xFFFFFFFF) << RTC_MODE0_COUNT_COUNT_Pos)  /* (RTC_MODE0_COUNT) Counter Value Mask */
#define RTC_MODE0_COUNT_COUNT(value)          (RTC_MODE0_COUNT_COUNT_Msk & (_UINT32_(value) << RTC_MODE0_COUNT_COUNT_Pos)) /* Assignment of value for COUNT in the RTC_MODE0_COUNT register */
#define RTC_MODE0_COUNT_Msk                   _UINT32_(0xFFFFFFFF)                                 /* (RTC_MODE0_COUNT) Register Mask  */


/* -------- RTC_MODE1_COUNT : (RTC Offset: 0x18) (R/W 16) MODE1 Counter Value -------- */
#define RTC_MODE1_COUNT_RESETVALUE            _UINT16_(0x00)                                       /*  (RTC_MODE1_COUNT) MODE1 Counter Value  Reset Value */

#define RTC_MODE1_COUNT_COUNT_Pos             _UINT16_(0)                                          /* (RTC_MODE1_COUNT) Counter Value Position */
#define RTC_MODE1_COUNT_COUNT_Msk             (_UINT16_(0xFFFF) << RTC_MODE1_COUNT_COUNT_Pos)      /* (RTC_MODE1_COUNT) Counter Value Mask */
#define RTC_MODE1_COUNT_COUNT(value)          (RTC_MODE1_COUNT_COUNT_Msk & (_UINT16_(value) << RTC_MODE1_COUNT_COUNT_Pos)) /* Assignment of value for COUNT in the RTC_MODE1_COUNT register */
#define RTC_MODE1_COUNT_Msk                   _UINT16_(0xFFFF)                                     /* (RTC_MODE1_COUNT) Register Mask  */


/* -------- RTC_MODE2_CLOCK : (RTC Offset: 0x18) (R/W 32) MODE2 Clock Value -------- */
#define RTC_MODE2_CLOCK_RESETVALUE            _UINT32_(0x00)                                       /*  (RTC_MODE2_CLOCK) MODE2 Clock Value  Reset Value */

#define RTC_MODE2_CLOCK_SECOND_Pos            _UINT32_(0)                                          /* (RTC_MODE2_CLOCK) Second Position */
#define RTC_MODE2_CLOCK_SECOND_Msk            (_UINT32_(0x3F) << RTC_MODE2_CLOCK_SECOND_Pos)       /* (RTC_MODE2_CLOCK) Second Mask */
#define RTC_MODE2_CLOCK_SECOND(value)         (RTC_MODE2_CLOCK_SECOND_Msk & (_UINT32_(value) << RTC_MODE2_CLOCK_SECOND_Pos)) /* Assignment of value for SECOND in the RTC_MODE2_CLOCK register */
#define RTC_MODE2_CLOCK_MINUTE_Pos            _UINT32_(6)                                          /* (RTC_MODE2_CLOCK) Minute Position */
#define RTC_MODE2_CLOCK_MINUTE_Msk            (_UINT32_(0x3F) << RTC_MODE2_CLOCK_MINUTE_Pos)       /* (RTC_MODE2_CLOCK) Minute Mask */
#define RTC_MODE2_CLOCK_MINUTE(value)         (RTC_MODE2_CLOCK_MINUTE_Msk & (_UINT32_(value) << RTC_MODE2_CLOCK_MINUTE_Pos)) /* Assignment of value for MINUTE in the RTC_MODE2_CLOCK register */
#define RTC_MODE2_CLOCK_DAY_Pos               _UINT32_(17)                                         /* (RTC_MODE2_CLOCK) Day Position */
#define RTC_MODE2_CLOCK_DAY_Msk               (_UINT32_(0x1F) << RTC_MODE2_CLOCK_DAY_Pos)          /* (RTC_MODE2_CLOCK) Day Mask */
#define RTC_MODE2_CLOCK_DAY(value)            (RTC_MODE2_CLOCK_DAY_Msk & (_UINT32_(value) << RTC_MODE2_CLOCK_DAY_Pos)) /* Assignment of value for DAY in the RTC_MODE2_CLOCK register */
#define RTC_MODE2_CLOCK_MONTH_Pos             _UINT32_(22)                                         /* (RTC_MODE2_CLOCK) Month Position */
#define RTC_MODE2_CLOCK_MONTH_Msk             (_UINT32_(0xF) << RTC_MODE2_CLOCK_MONTH_Pos)         /* (RTC_MODE2_CLOCK) Month Mask */
#define RTC_MODE2_CLOCK_MONTH(value)          (RTC_MODE2_CLOCK_MONTH_Msk & (_UINT32_(value) << RTC_MODE2_CLOCK_MONTH_Pos)) /* Assignment of value for MONTH in the RTC_MODE2_CLOCK register */
#define   RTC_MODE2_CLOCK_MONTH_JAN_Val       _UINT32_(0x1)                                        /* (RTC_MODE2_CLOCK) January  */
#define   RTC_MODE2_CLOCK_MONTH_FEB_Val       _UINT32_(0x2)                                        /* (RTC_MODE2_CLOCK) February  */
#define   RTC_MODE2_CLOCK_MONTH_MAR_Val       _UINT32_(0x3)                                        /* (RTC_MODE2_CLOCK) March  */
#define   RTC_MODE2_CLOCK_MONTH_APR_Val       _UINT32_(0x4)                                        /* (RTC_MODE2_CLOCK) April  */
#define   RTC_MODE2_CLOCK_MONTH_MAY_Val       _UINT32_(0x5)                                        /* (RTC_MODE2_CLOCK) May  */
#define   RTC_MODE2_CLOCK_MONTH_JUN_Val       _UINT32_(0x6)                                        /* (RTC_MODE2_CLOCK) June  */
#define   RTC_MODE2_CLOCK_MONTH_JUL_Val       _UINT32_(0x7)                                        /* (RTC_MODE2_CLOCK) July  */
#define   RTC_MODE2_CLOCK_MONTH_AUG_Val       _UINT32_(0x8)                                        /* (RTC_MODE2_CLOCK) August  */
#define   RTC_MODE2_CLOCK_MONTH_SEP_Val       _UINT32_(0x9)                                        /* (RTC_MODE2_CLOCK) September  */
#define   RTC_MODE2_CLOCK_MONTH_OCT_Val       _UINT32_(0xA)                                        /* (RTC_MODE2_CLOCK) October  */
#define   RTC_MODE2_CLOCK_MONTH_NOV_Val       _UINT32_(0xB)                                        /* (RTC_MODE2_CLOCK) November  */
#define   RTC_MODE2_CLOCK_MONTH_DEC_Val       _UINT32_(0xC)                                        /* (RTC_MODE2_CLOCK) December  */
#define RTC_MODE2_CLOCK_MONTH_JAN             (RTC_MODE2_CLOCK_MONTH_JAN_Val << RTC_MODE2_CLOCK_MONTH_Pos) /* (RTC_MODE2_CLOCK) January Position */
#define RTC_MODE2_CLOCK_MONTH_FEB             (RTC_MODE2_CLOCK_MONTH_FEB_Val << RTC_MODE2_CLOCK_MONTH_Pos) /* (RTC_MODE2_CLOCK) February Position */
#define RTC_MODE2_CLOCK_MONTH_MAR             (RTC_MODE2_CLOCK_MONTH_MAR_Val << RTC_MODE2_CLOCK_MONTH_Pos) /* (RTC_MODE2_CLOCK) March Position */
#define RTC_MODE2_CLOCK_MONTH_APR             (RTC_MODE2_CLOCK_MONTH_APR_Val << RTC_MODE2_CLOCK_MONTH_Pos) /* (RTC_MODE2_CLOCK) April Position */
#define RTC_MODE2_CLOCK_MONTH_MAY             (RTC_MODE2_CLOCK_MONTH_MAY_Val << RTC_MODE2_CLOCK_MONTH_Pos) /* (RTC_MODE2_CLOCK) May Position */
#define RTC_MODE2_CLOCK_MONTH_JUN             (RTC_MODE2_CLOCK_MONTH_JUN_Val << RTC_MODE2_CLOCK_MONTH_Pos) /* (RTC_MODE2_CLOCK) June Position */
#define RTC_MODE2_CLOCK_MONTH_JUL             (RTC_MODE2_CLOCK_MONTH_JUL_Val << RTC_MODE2_CLOCK_MONTH_Pos) /* (RTC_MODE2_CLOCK) July Position */
#define RTC_MODE2_CLOCK_MONTH_AUG             (RTC_MODE2_CLOCK_MONTH_AUG_Val << RTC_MODE2_CLOCK_MONTH_Pos) /* (RTC_MODE2_CLOCK) August Position */
#define RTC_MODE2_CLOCK_MONTH_SEP             (RTC_MODE2_CLOCK_MONTH_SEP_Val << RTC_MODE2_CLOCK_MONTH_Pos) /* (RTC_MODE2_CLOCK) September Position */
#define RTC_MODE2_CLOCK_MONTH_OCT             (RTC_MODE2_CLOCK_MONTH_OCT_Val << RTC_MODE2_CLOCK_MONTH_Pos) /* (RTC_MODE2_CLOCK) October Position */
#define RTC_MODE2_CLOCK_MONTH_NOV             (RTC_MODE2_CLOCK_MONTH_NOV_Val << RTC_MODE2_CLOCK_MONTH_Pos) /* (RTC_MODE2_CLOCK) November Position */
#define RTC_MODE2_CLOCK_MONTH_DEC             (RTC_MODE2_CLOCK_MONTH_DEC_Val << RTC_MODE2_CLOCK_MONTH_Pos) /* (RTC_MODE2_CLOCK) December Position */
#define RTC_MODE2_CLOCK_YEAR_Pos              _UINT32_(26)                                         /* (RTC_MODE2_CLOCK) Year Position */
#define RTC_MODE2_CLOCK_YEAR_Msk              (_UINT32_(0x3F) << RTC_MODE2_CLOCK_YEAR_Pos)         /* (RTC_MODE2_CLOCK) Year Mask */
#define RTC_MODE2_CLOCK_YEAR(value)           (RTC_MODE2_CLOCK_YEAR_Msk & (_UINT32_(value) << RTC_MODE2_CLOCK_YEAR_Pos)) /* Assignment of value for YEAR in the RTC_MODE2_CLOCK register */
#define RTC_MODE2_CLOCK_Msk                   _UINT32_(0xFFFE0FFF)                                 /* (RTC_MODE2_CLOCK) Register Mask  */

/* CLK12H mode */
#define RTC_MODE2_CLOCK_CLK12H_HOUR_Pos       _UINT32_(12)                                         /* (RTC_MODE2_CLOCK) Hour Position */
#define RTC_MODE2_CLOCK_CLK12H_HOUR_Msk       (_UINT32_(0xF) << RTC_MODE2_CLOCK_CLK12H_HOUR_Pos)   /* (RTC_MODE2_CLOCK) Hour Mask */
#define RTC_MODE2_CLOCK_CLK12H_HOUR(value)    (RTC_MODE2_CLOCK_CLK12H_HOUR_Msk & (_UINT32_(value) << RTC_MODE2_CLOCK_CLK12H_HOUR_Pos))
#define RTC_MODE2_CLOCK_CLK12H_INDICATOR_Pos  _UINT32_(16)                                         /* (RTC_MODE2_CLOCK) Meridiem Indicator Position */
#define RTC_MODE2_CLOCK_CLK12H_INDICATOR_Msk  (_UINT32_(0x1) << RTC_MODE2_CLOCK_CLK12H_INDICATOR_Pos) /* (RTC_MODE2_CLOCK) Meridiem Indicator Mask */
#define RTC_MODE2_CLOCK_CLK12H_INDICATOR(value) (RTC_MODE2_CLOCK_CLK12H_INDICATOR_Msk & (_UINT32_(value) << RTC_MODE2_CLOCK_CLK12H_INDICATOR_Pos))
#define   RTC_MODE2_CLOCK_CLK12H_INDICATOR_AM_Val _UINT32_(0x0)                                        /* (RTC_MODE2_CLOCK) Before midday (AM)  */
#define   RTC_MODE2_CLOCK_CLK12H_INDICATOR_PM_Val _UINT32_(0x1)                                        /* (RTC_MODE2_CLOCK) After midday (PM)  */
#define RTC_MODE2_CLOCK_CLK12H_INDICATOR_AM   (RTC_MODE2_CLOCK_CLK12H_INDICATOR_AM_Val << RTC_MODE2_CLOCK_CLK12H_INDICATOR_Pos) /* (RTC_MODE2_CLOCK) Before midday (AM) Position */
#define RTC_MODE2_CLOCK_CLK12H_INDICATOR_PM   (RTC_MODE2_CLOCK_CLK12H_INDICATOR_PM_Val << RTC_MODE2_CLOCK_CLK12H_INDICATOR_Pos) /* (RTC_MODE2_CLOCK) After midday (PM) Position */
#define RTC_MODE2_CLOCK_CLK12H_Msk            _UINT32_(0x0001F000)                                 /* (RTC_MODE2_CLOCK_CLK12H) Register Mask  */

