Microchip-MPLAB-Harmony/touch_apps/apps/qt8_selfcap_surface_xpro_board/pic32cm_pl10_cnano_water_tolerance/firmware/src/packs/PIC32CM6408PL10048_DFP/component/rtc.h
/* CLK24H mode */
#define RTC_MODE2_CLOCK_CLK24H_HOUR_Pos       _UINT32_(12)                                         /* (RTC_MODE2_CLOCK) Hour Position */
#define RTC_MODE2_CLOCK_CLK24H_HOUR_Msk       (_UINT32_(0x1F) << RTC_MODE2_CLOCK_CLK24H_HOUR_Pos)  /* (RTC_MODE2_CLOCK) Hour Mask */
#define RTC_MODE2_CLOCK_CLK24H_HOUR(value)    (RTC_MODE2_CLOCK_CLK24H_HOUR_Msk & (_UINT32_(value) << RTC_MODE2_CLOCK_CLK24H_HOUR_Pos))
#define RTC_MODE2_CLOCK_CLK24H_Msk            _UINT32_(0x0001F000)                                 /* (RTC_MODE2_CLOCK_CLK24H) Register Mask  */


/* -------- RTC_MODE1_PER : (RTC Offset: 0x1C) (R/W 16) MODE1 Counter Period -------- */
#define RTC_MODE1_PER_RESETVALUE              _UINT16_(0x00)                                       /*  (RTC_MODE1_PER) MODE1 Counter Period  Reset Value */

#define RTC_MODE1_PER_PER_Pos                 _UINT16_(0)                                          /* (RTC_MODE1_PER) Counter Period Position */
#define RTC_MODE1_PER_PER_Msk                 (_UINT16_(0xFFFF) << RTC_MODE1_PER_PER_Pos)          /* (RTC_MODE1_PER) Counter Period Mask */
#define RTC_MODE1_PER_PER(value)              (RTC_MODE1_PER_PER_Msk & (_UINT16_(value) << RTC_MODE1_PER_PER_Pos)) /* Assignment of value for PER in the RTC_MODE1_PER register */
#define RTC_MODE1_PER_Msk                     _UINT16_(0xFFFF)                                     /* (RTC_MODE1_PER) Register Mask  */


/* -------- RTC_MODE0_COMP : (RTC Offset: 0x20) (R/W 32) MODE0 Compare # Value -------- */
#define RTC_MODE0_COMP_RESETVALUE             _UINT32_(0x00)                                       /*  (RTC_MODE0_COMP) MODE0 Compare # Value  Reset Value */

#define RTC_MODE0_COMP_COMP_Pos               _UINT32_(0)                                          /* (RTC_MODE0_COMP) Compare Value Position */
#define RTC_MODE0_COMP_COMP_Msk               (_UINT32_(0xFFFFFFFF) << RTC_MODE0_COMP_COMP_Pos)    /* (RTC_MODE0_COMP) Compare Value Mask */
#define RTC_MODE0_COMP_COMP(value)            (RTC_MODE0_COMP_COMP_Msk & (_UINT32_(value) << RTC_MODE0_COMP_COMP_Pos)) /* Assignment of value for COMP in the RTC_MODE0_COMP register */
#define RTC_MODE0_COMP_Msk                    _UINT32_(0xFFFFFFFF)                                 /* (RTC_MODE0_COMP) Register Mask  */


/* -------- RTC_MODE1_COMP : (RTC Offset: 0x20) (R/W 16) MODE1 Compare # Value -------- */
#define RTC_MODE1_COMP_RESETVALUE             _UINT16_(0x00)                                       /*  (RTC_MODE1_COMP) MODE1 Compare # Value  Reset Value */

#define RTC_MODE1_COMP_COMP_Pos               _UINT16_(0)                                          /* (RTC_MODE1_COMP) Compare Value Position */
#define RTC_MODE1_COMP_COMP_Msk               (_UINT16_(0xFFFF) << RTC_MODE1_COMP_COMP_Pos)        /* (RTC_MODE1_COMP) Compare Value Mask */
#define RTC_MODE1_COMP_COMP(value)            (RTC_MODE1_COMP_COMP_Msk & (_UINT16_(value) << RTC_MODE1_COMP_COMP_Pos)) /* Assignment of value for COMP in the RTC_MODE1_COMP register */
#define RTC_MODE1_COMP_Msk                    _UINT16_(0xFFFF)                                     /* (RTC_MODE1_COMP) Register Mask  */


/* -------- RTC_MODE2_ALARM0 : (RTC Offset: 0x20) (R/W 32) MODE2 Alarm 0 Value -------- */
#define RTC_MODE2_ALARM0_RESETVALUE           _UINT32_(0x00)                                       /*  (RTC_MODE2_ALARM0) MODE2 Alarm 0 Value  Reset Value */

#define RTC_MODE2_ALARM0_SECOND_Pos           _UINT32_(0)                                          /* (RTC_MODE2_ALARM0) Second Position */
#define RTC_MODE2_ALARM0_SECOND_Msk           (_UINT32_(0x3F) << RTC_MODE2_ALARM0_SECOND_Pos)      /* (RTC_MODE2_ALARM0) Second Mask */
#define RTC_MODE2_ALARM0_SECOND(value)        (RTC_MODE2_ALARM0_SECOND_Msk & (_UINT32_(value) << RTC_MODE2_ALARM0_SECOND_Pos)) /* Assignment of value for SECOND in the RTC_MODE2_ALARM0 register */
#define RTC_MODE2_ALARM0_MINUTE_Pos           _UINT32_(6)                                          /* (RTC_MODE2_ALARM0) Minute Position */
#define RTC_MODE2_ALARM0_MINUTE_Msk           (_UINT32_(0x3F) << RTC_MODE2_ALARM0_MINUTE_Pos)      /* (RTC_MODE2_ALARM0) Minute Mask */
#define RTC_MODE2_ALARM0_MINUTE(value)        (RTC_MODE2_ALARM0_MINUTE_Msk & (_UINT32_(value) << RTC_MODE2_ALARM0_MINUTE_Pos)) /* Assignment of value for MINUTE in the RTC_MODE2_ALARM0 register */
#define RTC_MODE2_ALARM0_DAY_Pos              _UINT32_(17)                                         /* (RTC_MODE2_ALARM0) Day Position */
#define RTC_MODE2_ALARM0_DAY_Msk              (_UINT32_(0x1F) << RTC_MODE2_ALARM0_DAY_Pos)         /* (RTC_MODE2_ALARM0) Day Mask */
#define RTC_MODE2_ALARM0_DAY(value)           (RTC_MODE2_ALARM0_DAY_Msk & (_UINT32_(value) << RTC_MODE2_ALARM0_DAY_Pos)) /* Assignment of value for DAY in the RTC_MODE2_ALARM0 register */
#define RTC_MODE2_ALARM0_MONTH_Pos            _UINT32_(22)                                         /* (RTC_MODE2_ALARM0) Month Position */
#define RTC_MODE2_ALARM0_MONTH_Msk            (_UINT32_(0xF) << RTC_MODE2_ALARM0_MONTH_Pos)        /* (RTC_MODE2_ALARM0) Month Mask */
#define RTC_MODE2_ALARM0_MONTH(value)         (RTC_MODE2_ALARM0_MONTH_Msk & (_UINT32_(value) << RTC_MODE2_ALARM0_MONTH_Pos)) /* Assignment of value for MONTH in the RTC_MODE2_ALARM0 register */
#define   RTC_MODE2_ALARM0_MONTH_JAN_Val      _UINT32_(0x1)                                        /* (RTC_MODE2_ALARM0) January  */
#define   RTC_MODE2_ALARM0_MONTH_FEB_Val      _UINT32_(0x2)                                        /* (RTC_MODE2_ALARM0) February  */
#define   RTC_MODE2_ALARM0_MONTH_MAR_Val      _UINT32_(0x3)                                        /* (RTC_MODE2_ALARM0) March  */
#define   RTC_MODE2_ALARM0_MONTH_APR_Val      _UINT32_(0x4)                                        /* (RTC_MODE2_ALARM0) April  */
#define   RTC_MODE2_ALARM0_MONTH_MAY_Val      _UINT32_(0x5)                                        /* (RTC_MODE2_ALARM0) May  */
#define   RTC_MODE2_ALARM0_MONTH_JUN_Val      _UINT32_(0x6)                                        /* (RTC_MODE2_ALARM0) June  */
#define   RTC_MODE2_ALARM0_MONTH_JUL_Val      _UINT32_(0x7)                                        /* (RTC_MODE2_ALARM0) July  */
#define   RTC_MODE2_ALARM0_MONTH_AUG_Val      _UINT32_(0x8)                                        /* (RTC_MODE2_ALARM0) August  */
#define   RTC_MODE2_ALARM0_MONTH_SEP_Val      _UINT32_(0x9)                                        /* (RTC_MODE2_ALARM0) September  */
#define   RTC_MODE2_ALARM0_MONTH_OCT_Val      _UINT32_(0xA)                                        /* (RTC_MODE2_ALARM0) October  */
#define   RTC_MODE2_ALARM0_MONTH_NOV_Val      _UINT32_(0xB)                                        /* (RTC_MODE2_ALARM0) November  */
#define   RTC_MODE2_ALARM0_MONTH_DEC_Val      _UINT32_(0xC)                                        /* (RTC_MODE2_ALARM0) December  */
#define RTC_MODE2_ALARM0_MONTH_JAN            (RTC_MODE2_ALARM0_MONTH_JAN_Val << RTC_MODE2_ALARM0_MONTH_Pos) /* (RTC_MODE2_ALARM0) January Position */
#define RTC_MODE2_ALARM0_MONTH_FEB            (RTC_MODE2_ALARM0_MONTH_FEB_Val << RTC_MODE2_ALARM0_MONTH_Pos) /* (RTC_MODE2_ALARM0) February Position */
#define RTC_MODE2_ALARM0_MONTH_MAR            (RTC_MODE2_ALARM0_MONTH_MAR_Val << RTC_MODE2_ALARM0_MONTH_Pos) /* (RTC_MODE2_ALARM0) March Position */
#define RTC_MODE2_ALARM0_MONTH_APR            (RTC_MODE2_ALARM0_MONTH_APR_Val << RTC_MODE2_ALARM0_MONTH_Pos) /* (RTC_MODE2_ALARM0) April Position */
#define RTC_MODE2_ALARM0_MONTH_MAY            (RTC_MODE2_ALARM0_MONTH_MAY_Val << RTC_MODE2_ALARM0_MONTH_Pos) /* (RTC_MODE2_ALARM0) May Position */
#define RTC_MODE2_ALARM0_MONTH_JUN            (RTC_MODE2_ALARM0_MONTH_JUN_Val << RTC_MODE2_ALARM0_MONTH_Pos) /* (RTC_MODE2_ALARM0) June Position */
#define RTC_MODE2_ALARM0_MONTH_JUL            (RTC_MODE2_ALARM0_MONTH_JUL_Val << RTC_MODE2_ALARM0_MONTH_Pos) /* (RTC_MODE2_ALARM0) July Position */
#define RTC_MODE2_ALARM0_MONTH_AUG            (RTC_MODE2_ALARM0_MONTH_AUG_Val << RTC_MODE2_ALARM0_MONTH_Pos) /* (RTC_MODE2_ALARM0) August Position */
#define RTC_MODE2_ALARM0_MONTH_SEP            (RTC_MODE2_ALARM0_MONTH_SEP_Val << RTC_MODE2_ALARM0_MONTH_Pos) /* (RTC_MODE2_ALARM0) September Position */
#define RTC_MODE2_ALARM0_MONTH_OCT            (RTC_MODE2_ALARM0_MONTH_OCT_Val << RTC_MODE2_ALARM0_MONTH_Pos) /* (RTC_MODE2_ALARM0) October Position */
#define RTC_MODE2_ALARM0_MONTH_NOV            (RTC_MODE2_ALARM0_MONTH_NOV_Val << RTC_MODE2_ALARM0_MONTH_Pos) /* (RTC_MODE2_ALARM0) November Position */
#define RTC_MODE2_ALARM0_MONTH_DEC            (RTC_MODE2_ALARM0_MONTH_DEC_Val << RTC_MODE2_ALARM0_MONTH_Pos) /* (RTC_MODE2_ALARM0) December Position */
#define RTC_MODE2_ALARM0_YEAR_Pos             _UINT32_(26)                                         /* (RTC_MODE2_ALARM0) Year Position */
#define RTC_MODE2_ALARM0_YEAR_Msk             (_UINT32_(0x3F) << RTC_MODE2_ALARM0_YEAR_Pos)        /* (RTC_MODE2_ALARM0) Year Mask */
#define RTC_MODE2_ALARM0_YEAR(value)          (RTC_MODE2_ALARM0_YEAR_Msk & (_UINT32_(value) << RTC_MODE2_ALARM0_YEAR_Pos)) /* Assignment of value for YEAR in the RTC_MODE2_ALARM0 register */
#define RTC_MODE2_ALARM0_Msk                  _UINT32_(0xFFFE0FFF)                                 /* (RTC_MODE2_ALARM0) Register Mask  */

/* CLK12H mode */
#define RTC_MODE2_ALARM0_CLK12H_HOUR_Pos      _UINT32_(12)                                         /* (RTC_MODE2_ALARM0) Hour Position */
#define RTC_MODE2_ALARM0_CLK12H_HOUR_Msk      (_UINT32_(0xF) << RTC_MODE2_ALARM0_CLK12H_HOUR_Pos)  /* (RTC_MODE2_ALARM0) Hour Mask */
#define RTC_MODE2_ALARM0_CLK12H_HOUR(value)   (RTC_MODE2_ALARM0_CLK12H_HOUR_Msk & (_UINT32_(value) << RTC_MODE2_ALARM0_CLK12H_HOUR_Pos))
#define RTC_MODE2_ALARM0_CLK12H_INDICATOR_Pos _UINT32_(16)                                         /* (RTC_MODE2_ALARM0) Meridiem Indicator Position */
#define RTC_MODE2_ALARM0_CLK12H_INDICATOR_Msk (_UINT32_(0x1) << RTC_MODE2_ALARM0_CLK12H_INDICATOR_Pos) /* (RTC_MODE2_ALARM0) Meridiem Indicator Mask */
#define RTC_MODE2_ALARM0_CLK12H_INDICATOR(value) (RTC_MODE2_ALARM0_CLK12H_INDICATOR_Msk & (_UINT32_(value) << RTC_MODE2_ALARM0_CLK12H_INDICATOR_Pos))
#define   RTC_MODE2_ALARM0_CLK12H_INDICATOR_AM_Val _UINT32_(0x0)                                        /* (RTC_MODE2_ALARM0) Before midday (AM)  */
#define   RTC_MODE2_ALARM0_CLK12H_INDICATOR_PM_Val _UINT32_(0x1)                                        /* (RTC_MODE2_ALARM0) After midday (PM)  */
#define RTC_MODE2_ALARM0_CLK12H_INDICATOR_AM  (RTC_MODE2_ALARM0_CLK12H_INDICATOR_AM_Val << RTC_MODE2_ALARM0_CLK12H_INDICATOR_Pos) /* (RTC_MODE2_ALARM0) Before midday (AM) Position */
#define RTC_MODE2_ALARM0_CLK12H_INDICATOR_PM  (RTC_MODE2_ALARM0_CLK12H_INDICATOR_PM_Val << RTC_MODE2_ALARM0_CLK12H_INDICATOR_Pos) /* (RTC_MODE2_ALARM0) After midday (PM) Position */
#define RTC_MODE2_ALARM0_CLK12H_Msk           _UINT32_(0x0001F000)                                 /* (RTC_MODE2_ALARM0_CLK12H) Register Mask  */

